{
  "_name_or_path": "/nas_works/467836/checkpoints/llama32-va432k-ep1-lora-va430k-ultrachat-ep1-lora",
  "architectures": [
    "OmniSpeech2SLlamaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 128000,
  "decoder_dropout": 0.1,
  "decoder_ffn_dim": 8192,
  "decoder_hidden_size": 2048,
  "decoder_num_heads": 32,
  "decoder_num_layers": 4,
  "deepspeed_config": null,
  "encoder_num_layers": 2,
  "eos_token_id": [
    128001,
    128008,
    128009
  ],
  "gen_loss_weight": 1.0,
  "group_size": 3,
  "head_dim": 64,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 8192,
  "llm_hidden_size": 2048,
  "max_position_embeddings": 131072,
  "max_seq_length": 8192,
  "max_speech_tokens": 4096,
  "mlp_bias": false,
  "mm_tunable_parts": "speech_generator",
  "model_type": "omni_speech2s_llama",
  "mtp_num": 5,
  "num_attention_heads": 32,
  "num_hidden_layers": 16,
  "num_key_value_heads": 8,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": {
    "factor": 32.0,
    "high_freq_factor": 4.0,
    "low_freq_factor": 1.0,
    "original_max_position_embeddings": 8192,
    "rope_type": "llama3"
  },
  "rope_theta": 500000.0,
  "special_tokens": 4,
  "speech_bos_token_id": 6561,
  "speech_encoder": "./models/speech_encoder/whisper-large-v3",
  "speech_encoder_ds_rate": 5,
  "speech_encoder_hidden_size": 1280,
  "speech_encoder_type": "whisper",
  "speech_eos_token_id": 6563,
  "speech_generator_config": "./scripts/mtp/ar_config_5.yaml",
  "speech_generator_type": "ar_mtp",
  "speech_max_position_embeddings": 2048,
  "speech_padding_token_id": 6564,
  "speech_projector_lr": null,
  "speech_projector_type": "linear",
  "speech_sos_token_id": 6562,
  "speech_token_num": 15,
  "switch_token_id": 6565,
  "tie_word_embeddings": true,
  "tokenizer_model_max_length": 4096,
  "tokenizer_padding_side": "right",
  "torch_dtype": "bfloat16",
  "transformers_version": "4.44.2",
  "txt_token_num": 5,
  "unit_vocab_size": 6561,
  "use_cache": true,
  "vocab_size": 128256
}
